{
	"@metadata": {
		"authors": [
			"Amire80",
			"Diegodlh",
			"Robby"
		]
	},
	"web2cit": "{{optional}}\nWeb2Cit label, shown as page title and heading on Web2Cit server's home page.",
	"home.subheading": "Web2Cit \"catchword\" to be shown as subheading on Web2Cit server's home page.",
	"home.target": "Placeholder text shown inside the text input field where the target URL should be entered on the server's home page.",
	"home.extract": "Label shown on the main button of the server's homepage, to get translation results for the target URL provided.",
	"home.config": "Label shown next to the drop-down menu to choose between main and sandbox configuration storage, on the server's home page.\n\nThe \"choice\" parameter is replaced by the drop-down menu.",
	"home.config.main": "Label for the \"Main\" configuration storage.",
	"home.config.sandbox": "{{identical|Sandbox}}",
	"home.config.user": "{{identical|Username}}",
	"home.debug": "Label shown on the server's homepage next to the checkbox to show debugging information on the translation overview page that would be returned next.",
	"title": "Title of the translation summary page.",
	"header": "Heading on the translation summary page, which will be followed by the name of the domain to which translated targets belong.",
	"config_main": "Label preceding the path from which domain configuration files have been retrieved from the main storage.",
	"config_sandbox": "Label preceding the path from which domain configuration files have been retrieved from the user's sandbox storage storage.\n\nThe \"user\" parameter is the username which owns the storage sandbox used.",
	"switch.switch": "Label on the button to switch between using main and user sandbox configuration storage.",
	"switch.main": "Label shown next to button that switches between configuration storages, when clicking the button would switch to using the main storage.",
	"switch.sandbox": "Label shown next to button that switches between configuration storages, when clicking the button would switch to using the user sandbox storage.",
	"switch.username": "{{identical|Username}}",
	"pattern_labelled": "Heading for translation results belonging to the same labelled translation subgroup. It is followed by the URL path pattern that defines the translation subgroup.\n\nThe \"label\" parameter is the label of the URL path pattern.",
	"pattern_unlabelled": "Heading for translation results belonging to the same unlabelled translation subgroup. It is followed by the URL path pattern that defines the translation subgroup.",
	"pattern_undefined": "Heading for translation results belonging to the same translation subgroup, when the URL path pattern that defines it is undefined.",
	"edit": "\"Edit\" label shown on the hyperlinks leading to the JSON editor used to edit templates, tests and patterns configuration files.",
	"target": "Heading preceding translation results for a specific target webpage. It is followed by the path of the target.",
	"template_labelled": "Heading for the translation result of a target webpage using a specific labelled translation template.\n\nThe \"index\" parameter is the position of the translation template on the list of candidate templates tried.\n\nThe \"label\" parameter is the label of the translation template.",
	"template_unlabelled": "Heading for the translation result of a target webpage using a specific unlabelled translation template.\n\nThe \"index\" parameter is the position of the translation template on the list of candidate templates tried.",
	"template_fallback": "Heading for the translation result of a target webpage using the fallback template.",
	"templatePath": "In cases where a translation template other than the fallback template has been used to return a translation result, this label precedes the path of the webpage after which the translation template used has been defined.",
	"fieldHeader": "Translation field header on the translation result table.",
	"outputHeader": "Header on the translation result table for the column listing the translation output from the translation template used, for each of the translation field rows.",
	"testHeader": "Header on the translation result table for the column listing the expected output as defined in the corresponding translation test, for each of the translation field rows.",
	"scoreHeader": "Header on the translation result table for the column listing the test scores for each translation field row.",
	"nonApplicable": "Short text shown in the translation result table indicating that an expected output or test score is not available for the given translation field.",
	"debug": "Heading preceding the debugging information for a given target, if it was been requested.",
	"debug.enable.description": "Text shown at the footer of the translation summary page with a link to refresh the page including debugging information.\n\nThe \"enable\" parameter is replaced with the corresponding link.",
	"debug.enable": "Label on the link to refresh the translation summary page to include debugging information.",
	"debug.disable.description": "Text shown at the footer of the translation summary page with a link to refresh the page excluding debugging information.\n\nThe \"disable\" parameter is replaced with the corresponding link: {{msg-wm|Web2cit-translation-debug.disable}}",
	"debug.disable": "Label on the link to refresh the translation summary page to exclude debugging information. Used in {{msg-wm|Web2cit-translation-debug.disable.description}}.",
	"field.itemType": "Label for the itemType translation field.",
	"field.title": "{{identical|Title}}",
	"field.authorLast": "Label for the authorLast translation field.",
	"field.authorFirst": "Label for the authorFirst translation field.",
	"field.date": "Label for the date translation field.",
	"field.publishedIn": "Label for the publishedIn translation field.",
	"field.publishedBy": "Label for the publishedBy translation field.",
	"field.language": "{{identical|Language}}",
	"error.noTarget": "Error shown when a server shortcut is used but the target URL is omitted. For example: https://web2cit.toolforge.org/debug/",
	"error.invalidTarget": "Error shown when the target URL provided is invalid. For example: https://web2cit.toolforge.org/abc\n\nIt is followed by the invalid target URL provided.",
	"error.noTargetPaths": "Error shown when the \"translate\" endpoint is used with a \"domain\" parameter, but no template or test paths are available from the corresponding configuration files.\n\nFor example: https://web2cit.toolforge.org/translate?domain=www.example.com, provided that no valid templates or tests have been defined for www.example.com",
	"error.domain": "Error shown when the \"translate\" endpoint is used with a \"domain\" parameter, but the domain provided is invalid. It is followed by the internal error returned.\n\nFor example: https://web2cit.toolforge.org/translate?domain=abc",
	"error.noTranslation": "Target-specific error message to show on the HTML translation summary page when no applicable translation template is found for a target webpage.",
	"error.targetTranslation": "Heading of the translation error message shown for specific target webpages, when translation errors occur and no target results can be shown."
}
